from pykrx import stock
import json
import os

tickers = [
    "005930", "000660", "373220", "207940", "005380", "012450", "105560", "000270", "034020", "068270",
    "329180", "035420", "055550", "028260", "012330", "011170", "042660", "005490", "011200", "086790",
    "015760", "035720", "009540", "032830", "006400", "009150", "018260", "086280", "017670", "096770",
    "034730", "051910", "034220", "051900", "066570", "011070", "032640", "047050", "456040", "010140",
    "009830", "017800", "272210", "000880", "000720", "128940", "302440", "285130", "326030", "377300",
    "196170", "247540", "003380", "086520", "028300", "214450", "000250", "084990", "277070", "145020",
    "298380", "214150", "058470", "950160", "214370", "257720", "041510", "039030", "206650", "035900",
    "082270", "068760", "263750", "403870", "237690", "065350", "140860", "007390", "357780", "096530",
    "347850", "122870", "005290", "035760", "293490", "253450", "328130", "036930", "240810", "348370",
    "039200", "358570", "018290", "095340", "178320", "083650", "195940", "376300", "140410", "078600"
]

start_date = "20250703"
end_date = "20250803"

# 최종 JSON 구조를 담을 딕셔너리
result_json = {}

output_path = './data/stock/output/returns_data.json'
os.makedirs(os.path.dirname(output_path), exist_ok=True)

for code in tickers:
    try:
        df = stock.get_market_ohlcv(start_date, end_date, code)
        close_prices = df["종가"]
        close_dict = {k.strftime("%Y-%m-%d"): int(v) for k, v in close_prices.items()}
        result_json[code] = close_dict
    except Exception as e:
        print(f"{code} 오류 발생: {e}")
        result_json[code] = {}

# JSON 파일로 저장
with open(output_path, "w", encoding="utf-8-sig") as f:
    json.dump(result_json, f, ensure_ascii=False, indent=2)

print("returns.json 저장 완료")
